# 데이터 설명
* customer_id: 고객 ID
* name: 고객 이름
* age: 고객 나이
* signup_date: 가입 날짜
* purchase_amount: 구매 금액
* is_active: 활성 상태

In [2]:
import pandas as pd 

# 데이터 생성
data_dict = {
    "customer_id": [101, 102, 103, 104, 105],
    "name": ["Alice", "Bob", "Charlie", None, "Eva"],
    "age": [25.0, 30.0, 28.0, 40.0, 35.0],
    "signup_date": ["2023-01-15", "2023-02-20", "2023-03-20", "2023-03-01", "2023-04-10"],
    "purchase_amount": [120.50, 120.2, 200.00, 150.75, 300.40],
    "is_active": [True, False, "yes", "no", True],
    "group": ["A", "A", "B", "C", "C"]
}

# 데이터프레임 생성
df = pd.DataFrame(data_dict)
df

   customer_id     name   age signup_date  purchase_amount is_active group
0          101    Alice  25.0  2023-01-15           120.50      True     A
1          102      Bob  30.0  2023-02-20           120.20     False     A
2          103  Charlie  28.0  2023-03-20           200.00       yes     B
3          104     None  40.0  2023-03-01           150.75        no     C
4          105      Eva  35.0  2023-04-10           300.40      True     C

# 1. `is_active` 열만 추출(loc 이용, iloc 이용)

In [3]:
# loc 이용
# 열 이름: is_active
df.loc[:, "is_active"]

0     True
1    False
2      yes
3       no
4     True
Name: is_active, dtype: object

In [8]:
# iloc 이용
# 열 이름: is_active
# is_active는 앞에서 5번째 요소
df.iloc[:, -2]

0     True
1    False
2      yes
3       no
4     True
Name: is_active, dtype: object

In [7]:
# is_active는 뒤에서 2번째 요소
df.iloc[:, -2]

0     True
1    False
2      yes
3       no
4     True
Name: is_active, dtype: object

# 2. `age`, `group` 열만 추출(loc 이용, iloc 이용)

In [9]:
# loc 이용
# 열 이름: age, group 
df.loc[ : , ["age", "group"]]

    age group
0  25.0     A
1  30.0     A
2  28.0     B
3  40.0     C
4  35.0     C

In [10]:
# iloc 이용
# 열 위치: age는 앞에서 2번째, group은 뒤에서 1번째
df.iloc[ : , [2, -1] ]

    age group
0  25.0     A
1  30.0     A
2  28.0     B
3  40.0     C
4  35.0     C

# 3. customer_id가 105인 행만 추출(loc 이용, iloc 이용)

In [11]:
# loc 이용
# 행 이름: 4
df.loc[ 4 , :]

customer_id               105
name                      Eva
age                      35.0
signup_date        2023-04-10
purchase_amount         300.4
is_active                True
group                       C
Name: 4, dtype: object

In [12]:
# iloc 이용
# 행 위치: 앞에서 4번째
df.iloc[ 4 , :]

customer_id               105
name                      Eva
age                      35.0
signup_date        2023-04-10
purchase_amount         300.4
is_active                True
group                       C
Name: 4, dtype: object

In [16]:
# iloc 이용
# 행 위치: 뒤에서 -1번째
df.iloc[ -1 , :]

customer_id               105
name                      Eva
age                      35.0
signup_date        2023-04-10
purchase_amount         300.4
is_active                True
group                       C
Name: 4, dtype: object

# 4. customer_id 가 103, 104, 105인 행만 추출(loc 이용, iloc 이용)

In [17]:
# loc 이용
# 행 이름: 2, 3, 4
df.loc[ [2, 3, 4], :]

   customer_id     name   age signup_date  purchase_amount is_active group
2          103  Charlie  28.0  2023-03-20           200.00       yes     B
3          104     None  40.0  2023-03-01           150.75        no     C
4          105      Eva  35.0  2023-04-10           300.40      True     C

In [18]:
# iloc 이용
# 행 번호: 앞에서 2번째부터 끝까지
df.iloc[ 2: , :]

   customer_id     name   age signup_date  purchase_amount is_active group
2          103  Charlie  28.0  2023-03-20           200.00       yes     B
3          104     None  40.0  2023-03-01           150.75        no     C
4          105      Eva  35.0  2023-04-10           300.40      True     C

In [19]:
# iloc 이용
# 행 번호: 뒤에서 3번째부터 끝까지
df.iloc[ -3: , :]

   customer_id     name   age signup_date  purchase_amount is_active group
2          103  Charlie  28.0  2023-03-20           200.00       yes     B
3          104     None  40.0  2023-03-01           150.75        no     C
4          105      Eva  35.0  2023-04-10           300.40      True     C

# 5. charlie 의 group 추출(loc 이용, iloc 이용)

In [20]:
# loc 이용
# 행 이름: 2
# 열 이름: group
df.loc[ 2, "group" ]

'B'

In [21]:
# iloc 이용
# 행 위치: 2
# 열 위치: 뒤에서 1번째
df.iloc[ 2, -1 ]

'B'

# 6. customer_id 가 102, 103인 데이터의 name, age 추출(loc 이용, iloc 이용)

In [24]:
# loc 이용
# 행 이름: 1, 2
# 열 이름: name, age
df.loc[ [1, 2], ["name", "age"] ]

      name   age
1      Bob  30.0
2  Charlie  28.0

In [22]:
# iloc 이용
# 행 위치: 앞에서 1번째부터 3번째 앞까지
# 열 위치: 앞에서 1번째부터 3번째 앞까지
df.iloc[ 1:3, 1:3 ]

      name   age
1      Bob  30.0
2  Charlie  28.0

# 7. Alice 의 customer_id, name, age  추출 (loc 이용, iloc 이용)

In [29]:
# loc 이용
# 행 이름: 0
# 열 이름: customer_id, name, age
df.loc[ 0, ["customer_id", "name", "age"] ]

customer_id      101
name           Alice
age             25.0
Name: 0, dtype: object

In [30]:
# iloc 이용
# 행 위치: 0
# 열 위치: 0번째부터 3번째 앞까지
df.iloc[ 0, :3]

customer_id      101
name           Alice
age             25.0
Name: 0, dtype: object

# 8. Bob, Eva 의 signup_date, is_activate 추출

In [31]:
# loc 이용
# 행 이름: 1, 4
# 열 이름: signup_date, is_active
df.loc[ [1, 4], ["signup_date", "is_active"]]

  signup_date is_active
1  2023-02-20     False
4  2023-04-10      True

In [34]:
# iloc 이용
# 행 위치: 1, 4
# 열 위치: 3, 6 
df.iloc[ [1, 4], [3, 5]]

  signup_date is_active
1  2023-02-20     False
4  2023-04-10      True

In [35]:
# iloc 이용
# 행 위치: 1, 4
# 열 위치: 3, -2
df.iloc[ [1, 4], [3, -2]]

  signup_date is_active
1  2023-02-20     False
4  2023-04-10      True